astrnox/aipassport/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 当前产品/固件基线使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 固定 8MB 镜像头，关闭 detect，便于 idf.py merge-bin。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=n
# 本产品不使用模板默认的最小分区表：NVS 扩到 88KB，并从 factory 尾部切出 2.625MB
# 的 assets 分区存动图帧。取舍理由见 docs/development/engineering/firmware-layout.md。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
# 20 ms display refresh period targets up to 50 FPS when rendering and SPI
# transfer complete within the same budget.
CONFIG_LV_DEF_REFR_PERIOD=20
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# 展示级数字(时钟、验证码、比分、倒计时)用 Montserrat 32/40,不额外带中文大字号。
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_40=y
# LVGL 内置 malloc 池大小(KB)。它是独立静态区、不与系统堆共享,配大了会白白占用 RAM。
# 工具箱界面比原 demo 复杂(滚动列表、环形进度、日历网格),24KB 偏紧,这里留足余量;
# 若出现绘制卡死/看门狗,再向上调。
CONFIG_LV_MEM_SIZE_KILOBYTES=48
# 名片动图用 animimg 逐帧播放。手机端已把 GIF 解码成 RGB565 帧,设备端不需要 GIF
# 解码器,所以这里不开 LV_USE_GIF——它对无 PSRAM 的 C3 来说内存代价过大。
CONFIG_LV_USE_ANIMIMG=y

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000

# --- Bluetooth LE / NimBLE ---
# ESP32-C3 仅支持 BLE；示例只启用单连接 peripheral 所需的最小 host 配置。
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_HOST_BASED_PRIVACY=n
CONFIG_BT_NIMBLE_NVS_PERSIST=n
# BLE 配网走 BLUFI 协议，需要 NimBLE 侧的 BLUFI 支持。
CONFIG_BT_NIMBLE_BLUFI_ENABLE=y
# BLUFI 用 DH 协商共享密钥，mbedTLS 的 DH 模块默认关闭，这里显式打开。
CONFIG_MBEDTLS_DHM_C=y
